<template>
  <div class="cnc-guidance">
    <h2>CNC下单必看</h2>
    <div class="indented-content">
      <p>CNC自动报价系统是基于3D图纸特征识别，结合大数据、神经网络算法，解决报价慢，不透明等行业痛疾，为保证您的下单体验，下单前请务必查看以下信息：</p>
      <h3>下单须知</h3>
      <div class="indented-content">
        <p>1.支持上传的图纸格式：3D格式（.step, .stp），2D格式（pdf、dwg、dxf），其中<strong>3D格式
          文件必须上传；</strong></p>
        <p>支持压缩包zip上传（系统只获取压缩包中上述支持的格式文件）；</p>
        <p>2.建议同时上传3D和2D图纸，<strong>同一款零件的3D和2D图纸要求名称必须一致</strong>，3D和2D不符时，
          系统以3D图为准；</p>
        <div class="risk-warning">
          <strong>风险提醒</strong>
          <p>1. 结构特征以3D图为准。</p>
          <p>2. 螺纹孔，激光打标，丝印，公差粗糙等，以2D图为准（如2D图与下单选择参数冲突，以系统为准）。</p>
          <p>3. 如需要加工螺纹，请在选择加工参数时，勾选“有螺纹”并上传2D图（2D格式可以为JPG、DWG、DXF、PDF），详细标注螺纹规格、牙距，深度尺等信息，比如 M8X1.25(粗牙可以不用标注螺距)。</p>
          <p>请务必留意：3D设计内螺纹时孔径按螺纹底孔直径设计 (例如攻牙M8*1.25，底孔应为φ6.8MM）。当底孔设计大了，导致无法攻牙时，工厂将默认镶钢丝牙套处理；如您的工件存在特殊螺纹（非标螺纹），无法镶钢丝牙套，需要寄适配件来配作时，请及时告知我们的客服人员，并将适配件寄到工厂，我们将根据您寄来的适配件来适配；若因缺少适配件导致内外螺纹配合不良，鉴于平台的运营模式和已提前告知的规则，平台无法对此承担直接责任。<a href="#" class="cnc-thread-note">&lt;&lt;CNC螺纹说明&gt;&gt;</a></p>
        </div>
        <p>3.单次上传图纸的数量≤20个，单个文件的大小＜100M；</p>
        <p>4.实际下单选择的加工参数（材质、数量、表处、精度等）与2D图面注明不一致时，按系统下
          单参数为准，审单生产时不做单独确认，由此造成损失由用户自行承担；</p>
      </div>
      <h3>自动报价须知</h3>
      <div class="indented-content">
        <p>1.暂不适用自动报价范围：</p>
        <p> 1）单零件数量>20个；</p>
        <p> 2）单个零件3D图纸包含多个模型、实体或装配体;</p>
        <p> 3）其它超出系统识别范围（如未解析获取零件信息/特征、特殊材质/表处等）；</p>
        <p>如有无法自动报价或系统报价偏差较大的零件，可继续提交询价，审单人员将在24小时内人
          工审核报价。</p>
        <p>2.系统报价及交期可能随着产能及市场波动而略有偏差，不作为最终交付标准，具体以审核后
          的价格交期为准（审核后待支付订单会显示审最终信息）；</p>
        <p>3.自动报价系统仅按常规加工工艺进行评估报价，如零件涉及特殊工艺加工，审核时将会单独
          计费。</p>
      </div>
      <h3>加工须知</h3>
      <div class="indented-content">
        <p> 1.最严公差选择仅代表当前零件有部分特征为该精度，不代表所有特征都按此标准加工，如<strong>有
            具体尺寸精度要求，请同步上传带标注的2D图纸，未注公差等级默认按照</strong><a href="#" class="cnc-thread-note">GB/T 1804-2000</a>
            <strong>的m级执行；</strong></p>
        <p> 2.有螺纹的零件，务必同步上传标注规格尺寸的螺纹图纸，如有特殊螺纹，需要提供实物适配
          （可联系客服快递邮寄），具体螺纹规格尺寸详见：<a href="#" class="cnc-thread-note">螺纹说明；</a></p>
        <p> 3.受限设备行程，当前最大可加工零件尺寸1000*800*550mm，超出暂不支持加工；</p>
        <p> 4.内直/锐角加工有圆角，大小与深度有关，具体详见：<a href="#" class="cnc-thread-note">加工低成本技巧</a>，如有特殊要求（将会
          产生一定的特殊工艺费用），可在下单备注中说明；</p>
        <p> 5.深腔、壁厚等要求详见：加工低成本技巧，超出可能无法加工。</p>
      </div>
      <h3>表面处理须知</h3>
      <div class="indented-content">
        <p>1.不喷砂会有轻微刀痕，表面略有刮花;</p>
        <p>2.如需做氧化处理，表面可能会存在挂点（会尽量做内测、内孔挂点，保证外观不受影响）；</p>
        <p>3.选择氧化表处默认不会做喷砂处理（如有需要，请务必选择喷砂表处）；</p>
        <p>4.太薄零件，表处容易变形，建议10*10*1mm以下零件不做表面处理（无夹位）；</p>
        <p>5.建议壁厚小于1.5mm的零件不做喷砂，喷砂后会严重变形；</p>
      </div>
      <h3>交期须知</h3>
      <div class="indented-content">
        <p>1.（约定）交期为系统发货日期，而非用户收货日期；</p>
        <p>2.系统评估交期与实际可能存在偏差，具体以订单审核后交期为准；</p>
        <p>3.订单约定交期按实际付款时间开始计算，19点后支付，交期顺延一天，周日、节假日将会同
          步顺延。</p>
      </div>
      <h3>其他须知</h3>
      <div class="indented-content">
        <p> 1.装配体零件平台不支持报价（系统&人工报价都不支持），请拆图后再上传（系统提供
          在线拆图功能，但复杂零件暂无法拆图）；</p>
        <p> 2.多零件间若有装配关系，下单时请务必备注适配出货；</p>
        <p> 3.订单如有问客信息需及时处理，否则会影响正常交期；</p>
        <p>如您在使用系统的过程中，有任何的意见或者建议，可联系我们业务联系人：</p>
        <p>欧海玉 18565854204，我们将竭诚为您服务。</p>
      </div>
    </div>
  </div>
</template>

<script setup>
</script>

<style scoped>
.cnc-guidance {
  padding: 20px;
}
.indented-content {
  padding-left: 4ch; /* 这里使用 4ch 实现缩进 4 个字符宽度，近似于 4 个空格的效果 */
}
.risk-warning {
  color: red;
  background-color: #ffebeb; /* 浅红色背景 */
  padding: 10px;
  margin-top: 10px;
  margin-bottom: 10px;
}
.cnc-thread-note {
  color: blue;
  text-decoration: none;
  cursor: pointer;
}
.cnc-thread-note:hover {
  text-decoration: underline;
}
</style>